refactor: 依赖关系图改为纯字符表达
